{
  "LITTLE PINES PRESCHOOL ANDIDRANE@GMAIL.COM": [
    "Thank you for your interest in Little Pines Preschool! We are a small and intimate licensed facility with a home like feel. We cater to 8 infant/toddlers and 23 Preschoolers. Little Pines strives to create a nurturing environment and we believe our youngest deserve dynamic curriculum, care, and plenty of opportunities for fun and discovery. Your child will have a age appropriate scheduled day filled with intentional play, promoting pro social development, and positive emotional interactions."
  ],
  "LITTLE PINES PRESCHOOL INFANT CENTER ANDIDRANE@GMAIL.COM": [
    "Thank you for your interest in Little Pines Preschool! We are a small and intimate licensed facility with a home like feel. We cater to 8 infant/toddlers and 23 Preschoolers. Little Pines strives to create a nurturing environment and we believe our youngest deserve dynamic curriculum, care, and plenty of opportunities for fun and discovery. Your child will have a age appropriate scheduled day filled with intentional play, promoting pro social development, and positive emotional interactions."
  ],
  "SUNNY DAYS PRESCHOOL SANSAR@SBCGLOBAL.NET": [
    "All classes are limited to only 6 children, which means individualized education and attention for your child and a strong sense of community and belonging for the class.",
    "Our teacher, Ms. Cindi, has a bachelor's degree in Early Childhood Education, as well as a bachelor's degree in Human Resource Development, specializing in Human Services, with minors in Psychology and Sociology. She has worked with young children and families in various capacities for many years.",
    "We believe children learn best through fun, engaging, hands-on activities. Each part of our preschool day is planned with goals in mind to help children grow spiritually, socially, emotionally, physically, and intellectually."
  ],
  "CHILD EDUCATIONAL CENTER SCHOOL AGE AT CALTECH LISA.CAIN@CECONLINE.ORG": [
    "Our program offers a curriculum that is stimulating and challenging to preschool children, as well as nurturing and supportive of each child's unique needs and learning style. Outdoor play and exploration is an integral component of each day, encouraging children to develop knowledge and love of the natural world. The daily schedule provides for activities specifically geared to the various developmental levels of children in the program, as well as opportunities for children to interact, teach, and learn from one another.",
    "The CEC’s Preschool Program is accredited by the National Association for the Education of Young Children (NAEYC). From guidelines for teacher preparation through safety standards, NAEYC Accreditation ensures that programs are safe, well prepared, and intentional about ensuring children's success.",
    "Our Preschool program at Caltech is also licensed by the state of California as a community care center under Title 22 - license #198016427."
  ],
  "MAD RIVER MONTESSORI SCHOOL/ VALLEY EAST BLVD. ARCATA.MONTESSORI@GMAIL.COM": [
    "Mad River Montessori School serves up to 30 children in a combined classroom setting. We serve children from the age of 3 through 6 years old, including the Kindergarten year.",
    "Mad River Montessori was founded in 1980 by Founding Directress Robin Renshaw, with the purpose of making high-quality Montessori education accessible for all interested families. This “education for life” has been time-tested for over 100 years, and has been successful in diverse cultures all over the world. Children work on activities of their own choosing, based on their own sensitivity to the lessons and materials. "
  ],
  "CHILDREN'S CHOICE ACADEMY, INC. CCLCCENTER@AOL.COM": [
    "My daughter attends Children’s Choice & she loves it. Shes currently in the two year old class. She’s usually pretty excited at drop off & I catch her playing with other kids and having fun in the afternoon for pick up. I love that Children’s choice provides food so we have one less thing to worry about on weeknights. My daughter is learning so much too.\n",
    "My son has been going to this location of Children's Choice since he was three months old and now he is almost 15 months old and he loves going there! I love the variety of activities they have for him everyday and the care they give him. The staff is very professional and kind and they always are happy to answer any questions that I have.\n",
    "I have had my daughter there since she was 2 and she is now going into 1st grade. They always make sure the kids are clean, happy and well taken care of. They will make the kids breakfast, lunch, snacks and if chr is still there late enough they will make them something for dinner time. All kids have individual cots for nap time and separate cups to drink from when old enough for cups.\n",
    "We love Children's Choice Academy. Our toddler daughter loves going every weekday. I also love the fact that they open at 6:00 AM, which works perfectly with our work schedule. They are also one of the most affordable daycares we found which includes Breakfast, Snack, Lunch and one more Snack. This is very helpful to us too. We thank Children's Choice Academy for all they do.\n",
    "I went to children's choice in August of 2018 on a Friday. My son started that following Monday and has been going there a year and a half now. They all treat him as their own and he loves all of the teachers so much. They always have activities going on, party's for holidays, and feed breakfast lunch and snacks. There are so many amazing things I can say about this school!\n\n",
    "The entire staff has been awesome and have treated my grandson like their own. He recently has been potty trained, just 2 weeks now, and they have been on top of it with him and he’s doing great now. They feed them breakfast, snacks, lunch, and snack again. They all take naps at the same time, which is amazing how they get all the kids on the same routine. This place is awesome and the staff are wonderful.\n",
    "Saftey is the top priority at this school which makes us feel great our grandkids attend here. The teachers take the time to get to know the kids & parents. Our grandkids always come home saying they enjoyed their day here & we can tell they are learning a lot of educational skills as well as interpersonal skills which will help them as they continue on in life.\n\n",
    "My kids have gone to Children's Choice Academy on Woodside Ave for 2 years. We are made to feel like we are all part of a family and it feels good to go to work knowing that my littles are loved and cared for. They have all kinds of fun events. And lastly, this is not a daycare, this is a preschool that teaches kids, not just academically, but socially and I would recommend you check it out for yourself.\n\n",
    "CCA is a wonderful daycare, especially if you are a working parent.  The caretakers are a great group of people.  Food is provided as well!  Kids have lots of age appropriate toys to play with.  The teachers interact with the kids in a very loving and caring way.  I would recommend anyone looking for a daycare to check CCA for availability.\n",
    "I can not say enough good things about children’s choice. Two of my kids went here since they were babies. They care for your kids like they are their own and really take the time to get to know not only your children, but you. They became like family:) and me and the kids will be stopping in to visit them every time we come home to visit. Recommend them 100%. Your kids will be in good hands at children’s choice:)\n"
  ],
  "EXPLORER MANDARIN IMMERSION EXPLORERMANDARINIMMERSION@GMAIL.COM": [
    "At Explorer, we believe that learning happens best when children are introduced to topics that are engaging, interesting, and meaningful. That is why we look to our children to create our curriculum as topics of interest, or current events, emerge. From there, we create hands-on projects, investigative activities, and invite related specialists (oftentimes parents!) into the classrooms to make a lasting impression of intentional teaching and learning.",
    "Explorer uses an emergent, play-based approach that emphasizes learning through curiosity, exploration, and discovery. This philosophy inspires our learning spaces and child-centered approach. Our nurturing and passionate educators encourage children to be creative in all areas, whether it is problem solving or the expressive arts. Our goal is for our children to become lateral thinkers and to engage in meaningful social interactions.",
    "Our indoor and outdoor classrooms are designed to cultivate the spirit of exploration while significantly incorporating elements of nature.",
    "Based in California, Explorer Mandarin Immersion provides intentional early learning and care for children aged 2 - 6 years. The primary language of instruction at Explorer is Mandarin, allowing students to be immersed in Chinese language and culture, however families of all language backgrounds are welcome. ",
    "Explorer uses an emergent, play-based approach that emphasizes learning through curiosity, exploration and discovery. This philosophy inspires the learning spaces and child-centered approach, and the nurturing and passionate educators encourage children to be creative in all areas, whether it is problem solving or the expressive arts. Explorer’s goal is for children to become lateral thinkers and to engage in meaningful social interactions. ",
    "Also central to Explorer’s philosophy is the nature-based approach to learning, where early childhood and environmental education are fused in order to support the holistic development of the child, as well as help build a lifelong connection with the natural world. Explorer’s indoor and outdoor spaces are designed to encourage children to investigate, discover and learn about their world. "
  ],
  "PROJECT COMMOTION-LAS LUCIERNAGAS SUSAN@PROJECTCOMMOTION.ORG": [
    "To accomplish this, Project Commotion combines specialized movement classes with academic enrichment preparing the minds and bodies of youth of all abilities to achieve the greatest possible success at school, at home and beyond.",
    "Project Commotion is a 501(c)3 non-profit, Tax ID#84-3634157. Your donation not only makes creating space for commotion in our community possible, but is also tax-deductible. Click the donate button for more info!"
  ],
  "CAJON VALLEY MADISON ELEMENTARY STATE PRESCHOOL PINKERTONV@CAJONVALLEY.NET": [
    "The state-funded preschool program is designed to provide a school readiness program for children ages 3-5 for income-eligible families. Parent participation is highly encouraged. Morning and afternoon classes run for three hours each, Monday through Friday."
  ],
  "WAY PRESCHOOL, THE GREGDENHAM2@GMAIL.COM": [
    "Brotherhood Way Preschool, located in the Lake Merced neighborhood, is rooted in Jewish values and San Francisco culture. We’re committed to giving children the freedom to discover their world through play.",
    "Our preschools are built upon shared goals, values and knowledge that deliver the highest quality experience possible. We’re committed to creating an inclusive community that’s infused with meaningful Jewish values. We celebrate holidays with our children and families throughout the year as well as a weekly Shabbat. Our program is built on the fundamental premise that children learn and understand their world through play. Inspired by the Reggio Emilia philosophy, we provide a variety of opportunities for learning, exploration, creativity and self-expression.",
    "It’s preschool tour time! Applications for the ’23 – ’24 school year are now open. Come discover why the JCCSF preschools are a wonderful place to learn, play and grow.",
    "We are back in our third year at preschool, and quite frankly are amazed at how well things are going amidst the pandemic. The school's health and safety protocols are top-notch, but the JOY is still there. I'm so grateful that my child is learning, having fun, and building relationships every day.",
    "This is our first year at the school and our 3-year old son is loving it. He has flourished and developed so much since starting in August. The teachers are caring, loving, and provide an engaging environment for kids . . . This school has my highest recommendation!",
    "My daughter is in her second year at the Brotherhood Way Preschool, and we have been very glad we found this community. She has truly been thriving from being around the teachers and children, and it's been great to get connected to more families here in the city . . . The situation with COVID-19 really drove home how important her school friends have been."
  ],
  "SANDY LOAM MONTESSORI INFO@SANDYLOAMMONTESSORI.COM": [
    "Our Montessori-inspired enrichment programs for preschool and elementary students integrate the fundamental principles of the Montessori Method with an immersive farm- and nature- based learning environment.\xa0 After-school programs and camps are hosted with appropriate health and safety measures in place.",
    "We are passionate about connecting and engaging with our young community members through activities that focus on environmental sustainability and Sonoma County’s diverse cultural heritage. Our next generation leaders are welcomed for workshops, volunteer opportunities, special events and more."
  ],
  "Zhi Weng Ye zhiye86@yahoo.com": [
    "Disclaimer: We at ChildcareCenter strive daily to keep our listings accurate and up-to-date, and to provide top-level,\npractical information that you can use and trust. However, ChildcareCenter.us does not endorse or recommend any of the childcare providers listed on its\nsite, cannot be held responsible or liable in any way for your dealings with them, and does not guarantee the accuracy of listings on its site. We provide\nthis site as a directory to assist you in locating childcare providers in your area. We do not own or operate any child care facility, and make no representation\nof any of the listings contained within ChildcareCenter.us."
  ]
}
